Tekla Open API Reference for Tekla Structures 2025
Grid.GridAttributes.DrawTextAtLeftOfGrid Property
 Set as true if you want to show the grid's text labels at the left of the grid.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DrawTextAtLeftOfGrid { get; set; }
Public Property DrawTextAtLeftOfGrid As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
Grid.GridAttributes Class
Tekla.Structures.Drawing Namespace